Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/family_home.html.txt.tmx
Source language: en
Languages: ga

source: Family and shared homes
ga: Teach an teaghlaigh agus tithe comhroinnte

source: The law in Ireland distinguishes between a family home and a shared home
ga: Déanann an dlí in Éirinn idirdhealú idir teach an teaghlaigh agus teach comhroinnte

source: A family home primarily means, a dwelling in which a married couple ordinarily resides
ga: Is é an chiall atá le teach an teaghlaigh, áit chónaithe ina gcónaíonn lánúin phósta, de ghnáth

source: Whilst some family homes are held in the sole name of one spouse, many family homes are held in the names of both spouses as a joint tenancy as this is often a condition of the mortgage used to buy the house
ga: Cé gurb in ainm duine de na céilí a bhíonn ainmneach tithe teaghlaigh de ghnáth, bíonn ainm na beirte céilí ar theach an teaghlaigh mar chomhthionóntacht mar gheall gur minic a bhíonn seo mar choinníoll den mhorgáiste a úsáideadh chun an teach a cheannach

source: The Government encourages spouses to put the family home into their joint names and there is no stamp duty or registry fees payable on the transfer of a family home into a joint tenancy
ga: Spreagann an rialtas dhá ainm na gcéilí a chur ar theach an teaghlaigh agus níl aon dleacht stampála nó táille chláraithe le híoc ar aistriú an dá ainm ar theach an teaghlaigh chuig comhthionóntacht

source: According to the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010 a shared home is a dwelling where civil partners ordinarily reside
ga: De réir an Achta um Páirtnéireacht Shibhialta agus Cearta agus Oibleagáidí Áirithe de chuid Comhchónaitheoirí, 2010 is áit chónaithe teach comhroinnte ina gcónaíonn páirtnéirí sibhialta de ghnáth

source: Where the shared home is held in the name of one of the civil partners, there is no stamp duty or registry fees payable on the transfer of the shared home into both their names as a joint tenancy
ga: Nuair a bhíonn an teach comhroinnte in ainm duine de na páirtnéirí sibhialta, níl aon dleacht stampála nó táille chláraithe le híoc ar aistriú an tí chomhroinnte chuig ainmneacha na beirte mar chomhthionóntacht

source: Protection is provided for the family home of a married couple under the Family Home Protection Act 1976 as amended by the Family Law Act 1995
ga: Foráiltear cosaint do theach teaghlaigh lánúine pósta faoin Acht um Chaomhnú Áras an Teaghlaigh, 1976 arna leasú ag an Acht um an Dlí Teaghlaigh,1995

source: Similar protection is provided for the shared home of civil partners by the civil partnership legislation
ga: Foráiltear a chomhionann de chosaint do theach comhroinnte páirtnéirí sibhialta ag an reachtaíocht um páirtnéireacht shibhialta

source: This legislation prevents one spouse/civil partner from selling, mortgaging, leasing or transferring the family/shared home without the consent of the other spouse/civil partner
ga: Cuireann an reachtaíocht seo cosc ar chéile/pháirtnéir sibhialta amháin ó theach an teaghlaigh/theach comhroinnte a dhíol, a mhorgáistiú, a ligean ar léas nó a aistriú gan toiliú na céile/an pháirtnéara shibhialta eile

source: The courts can dispense with the other spouse's/civil partner’s consent where it considers that the withholding of consent is unreasonable
ga: Féadfaidh na cúirteanna ligean thar ceal thoiliú na céile/an pháirtnéara shibhialta eile nuair a mheasann siad gur mí-réasúnta siarchoinneáil an toilithe

source: A spouse/civil partner is also able to apply to the courts for orders restraining the other spouse/civil partner from doing anything that might reduce his or her interest in the shared home or make it unsuitable to live in
ga: Féadfaidh céile/páirtnéir sibhialta iarratas a dhéanamh ar na cúirteanna ar orduithe a leagann srian ar an gcéile/bpáirtnéir sibhialta eile ó aon rud a dhéanamh a d’fhéadfadh a leas sa teach comhroinnte a laghdú nó an teach mí-oiriúnach a dhéanamh den teach sin chun cónaí ann

source: A spouse/civil partner may inform the Property Registration Authority that he or she is the spouse/civil partner of a property owner
ga: Féadfaidh céile/páirtnéir sibhialta an tÚdarás Clárúcháin Maoine a chur ar an eolas gur céile/páirtnéir sibhialta iad le húinéir réadmhaoine

source: A notice to that effect will then be registered
ga: Clárófar fógra chuige sin ina dhiaidh sin

source: There is no charge for such a registration
ga: Ní ghearrtar aon mhuirear ar chlárúchán den sórt sin

source: There is no requirement to enter such a registration and its absence does not affect the rights of a spouse/civil partner
ga: Níl aon cheanglas ann chun iontráil ina leithéid de chlárú agus mura ndéantar amhlaidh, ní dhéantar difear do chearta céile/páirtnéara shibhialta

source: The protection provided by the legislation is particularly important when the home is held in the name of only one spouse/civil partner
ga: Baineann tábhacht ar leith leis an gcosaint a chuireann an reachtaíocht ar fáil, nuair a bhíonn an teach á choimeád faoi ainm duine amháin de na céilí/páirntéirí sibhialta

source: One of the biggest problems facing separating couples/partners is what should happen to their family/shared home
ga: Ceann de na fadhbanna is mó a bhíonn ar lánúineacha/páirtnéirí a bhíonn ag scaradh óna chéile ná céard atá le tarlú do theach a dteaghlaigh/dá dteach comhroinnte

source: If agreement cannot be reached as to who will occupy and own the family/shared home, the court can make an order in relation to it
ga: Murar féidir comhaontú a bhaint amach maidir le cé a chónóidh i dteach an teaghlaigh/sa teach comhroinnte agus cé leis iad, féadfaidh an chúirt ordú a dhéanamh ina thaobh

source: An order in relation to the family/shared home is usually applied for when applying for a decree of judicial separation, divorce or dissolution and is referred to as a property adjustment order
ga: Is gnách go ndéantar iarratas ar ordú i dtaca le teach an teaghlaigh/teach comhroinnte nuair a dhéantar iarratas ar fhoraithne idirscartha bhreithiúnaigh, cholscartha nó dhíscaoilte agus tugtar ordú coigeartaithe réadmhaoine air

source: In making a property adjustment order, a court will consider all of the family circumstances and will take into account the welfare of a dependent spouse/civil partner and any dependent children
ga: Agus ordú coigeartaithe réadmhaoine á dhéanamh, déanfaidh cúirt breithniú ar gach ceann de chúinsí an teaghlaigh agus cuirfidh siad i gcuntas leas cleithiúnaí céile/páirtnéara shibhialta agus aon leanbh cleithiúnach

source: The court order will state the following:
ga: Luafaidh an t-ordú cúirte an méid a leanas:

source: • Who has the right to live in the family/shared home and for how long
ga: • Cé aige/aici a bhfuil an ceart chun cónaí i dteach an teaghlaigh/sa teach comhroinnte agus cé chomh fada is féidir leo amhlaidh a dhéanamh

source: • Who has ownership rights in the family/shared home and what share does each spouse/civil partner own
ga: • Cé aige/aici a bhfuil na cearta úinéireachta i dteach an teaghlaigh/sa teach comhroinnte agus cén sciar ar leis gach céile/páirtnéir sibhialta

source: Who has the right to live in the home and for how long?
ga: Cé aige/aici atá an ceart chun cónaí sa teach agus cé chomh fada is féidir leo cónaí ann?

source: In the case of a married couple where there are children, the spouse with whom the children live will often be given the right to live in the family home until the youngest child reaches 18 or 23
ga: I gcás lánúin phósta ag a bhfuil clann, is gnách go dtabharfar an ceart don chéile lena gcónaíonn na leanaí chun cónaí i dteach an teaghlaigh go dtí go mbaineann an leanbh is óige 18 nó 23 bliain amach

source: This can provide a sense of continuity for children who are experiencing the separation of their parents
ga: Féadfaidh seo braistint leanúnachais a chur ar fáil do leanaí atá thíos le scaradh a dtuismitheoirí

source: The Children and Family Relationships Act 2015 has amended the civil partnership legislation to provide similar protection for dependent children of civil partners
ga: Leasaigh Acht na Leanaí agus Teaghlaigh Caidrimh 2015 an reachtaíocht páirtnéireachta sibhialta chun cosaint den chineál céanna do leanaí cleithiúnacha páirtnéirí sibhialta a chur ar fáil

source: The court can make an exclusion order in relation to the spouse/civil partner who is leaving the family/shared home
ga: Féadfaidh an chúirt ordú eisiaimh a dhéanamh maidir leis an gcéile/bpáirtnéir sibhialta atá ag fágáil theach an teaghlaigh/an tí chomhroinnte

source: An exclusion order reflects the recognition of the courts that it is not practical for separated couples/partners to occupy the same house or for the spouses/civil partners who leave to retain a key and have free access to the house
ga: Léiríonn ordú eisiaimh go n-aithníonn na cúirteanna nach indeánta do lánúineacha/pháirtnéirí idirscartha cónaí sa teach céanna nó do chéilí/pháirtnéirí sibhialta a fhágann chun eochair a choimeád agus rochtain gan chosc a bheith acu ar an teach

source: It does not imply any unacceptable conduct on the part of the spouses/civil partners who are excluded from the house
ga: Ní chiallaíonn sé go bhfuil aon iompar neamh-inghlactha ar bun ag na céilí/páirtnéirí sibhialta atá eisiata ón teach

source: Who has ownership rights in the home and what share does each spouse/civil partner own?
ga: Cé aige/aici a bhfuil na cearta úinéireachta sa teach agus cén sciar ar leis gach céile/páirtnéir sibhialta?

source: A court can order that the house is sold and the proceeds divided equally or in whatever shares it considers just
ga: Is féidir leis an gcúirt a ordú go ndíolfar an teach agus go roinnfear an fáltas go cothrom eatarthu nó go dtugtar an sciar dóibh a mheastar is cóir

source: It can order that the sale be deferred for a specified period of time
ga: Féadfaidh siad a ordú go gcuirtear an díol ar athló ar feadh tréimhse shonrach ama

source: It can order the transfer of the house into joint names or into the sole name of one spouse/civil partner
ga: Féadfaidh siad a ordú go n-aistreofar an teach i gcomhainmneacha nó in ainm duine amháin de na céilí/páirtnéirí sibhialta

source: If the house is held under a tenancy from a local authority, it can order the transfer of the tenancy
ga: Má tá seilbh ar an teach faoi thionóntacht ó údarás áitiúil, féadfaidh siad aistriú na tionóntachta a ordú

source: Whether you are considering separating or applying for a decree of divorce/dissolution it is advisable to get legal advice
ga: Cibé acu má tá tú ag smaoineamh faoi idirscaradh a fháil nó iarratas a dhéanamh ar fhoraithne cholscartha/dhíscaoilte, moltar duit comhairle dlí a fháil

source: If you choose to hire a private solicitor, you should be aware that there is no fixed rate of charges for legal fees in Ireland
ga: Ma roghnaíonn tú chun aturnae príobháideach a fháil, ba cheart duit a bheith feasach nach ann d’aon ráta seasta muirear le haghaidh táillí dlí in Éirinn

source: You are advised to obtain some quotes before deciding on a legal firm
ga: Moltar duit roinnt meastacháin luacha a fháil sula ndéanann tú cinneadh ar ghnóthas dlíthiúil

source: Contact information for solicitors firms throughout Ireland is available on the Law Society website
ga: Tá fáil ar fháisnéis teagmhála ar ghnóthais aturnaetha ar fud na hÉireann ar láithreán gréasáin Dhlí-Chumann na hÉireann

source: To enquire whether you are eligible for legal aid or advice from the Legal Aid Board, contact your nearest law centre
ga: Chun fiosrúchán a dhéanamh faoi cibé acu an bhfuil tú i dteideal cúnamh nó comhairle dlí a fháil ón mBord um Chúnamh Dlíthiúil, déan teagmháil le d’ionad dlí áitiúil

source: The law centre staff will assess your means and advise on financial eligibility
ga: Déanfaidh foireann an ionaid dlí measúnú ar do mhaoin agus comhairle a chur ort faoi theidlíocht airgeadais

source: Legal aid is not free and everyone must pay a contribution towards costs
ga: Níl cúnamh dlíthiúil saor in aisce agus tá ar gach duine ranníocaíocht a íoc i dtreo na gcostas

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagraíocht neamhspleách, dheonach FLAC (Ionaid Chomhairle Dlí Saor in Aisce) a oibríonn líonra de chlinicí um chomhairle dhlíthiúil ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún agus saor in aisce do chách

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Déan teagmháil le d’Ionad um Fhaisnéis do Shaoránaigh áitiúil chun teacht ar fhaisnéis ar sheirbhísí FLAC i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ina theannta sin, tá líne faisnéise agus atreoraithe á reáchtáil ag an FLAC le linn uaireanta oifige le haghaidh faisnéis bhunúsach dhlíthiúil
